configuration/src/InformationRegisters/ЗаинтересованныеЛица/ЗаинтересованныеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаинтересованныеЛица</name>
  <resources>
    <name>ОтношениеКПроекту</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Роль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Подписчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/СобытияПоЛичнымДелам/СобытияПоЛичнымДелам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СобытияПоЛичнымДелам</name>
  <enumValues>
    <name>МестоРаботыРегл</name>
  </enumValues>
  <enumValues>
    <name>ПереведенВДругоеПодразделение</name>
  </enumValues>
  <enumValues>
    <name>ПереведенВКастомнуюКоманду</name>
  </enumValues>
  <enumValues>
    <name>ПереведенВКоманду</name>
  </enumValues>
  <enumValues>
    <name>ПринятНаДолжность</name>
  </enumValues>
  <enumValues>
    <name>Уволен</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>RocketChatID</name>
    <comment>Имя пользователя RocketChat (значение поля &quot;username&quot;)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата и время создания пользователя</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторАД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРедмайн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьВсеОповещения</name>
    <comment>Хранит признак, что пользователь отключил оповещения в настройках.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольВОтделеIT</name>
    <comment>Хранит роль пользователя в IT-отделе (у роли пометка ПринадлежитITОтделу)</comment>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>СистемаПоУмолчанию</name>
    <type>
      <types>CatalogRef.СистемыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРабочийСтол</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиОповещений</name>
    <attributes>
      <name>КатегорияОповещения</name>
      <type>
        <types>EnumRef.КатегорииСообщенийПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭлектроннаяПочта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОповещениеВРабочийСтол</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодОтправки</name>
      <type>
        <types>EnumRef.ЧастотаОповещенийПользователя</types>
      </type>
    </attributes>
    <attributes>
      <name>СистемаВзаимодействия</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/ЗаинтересованныеЛица/Forms/ФормаЗаписи/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Объект") Тогда
		Запись.Объект = Параметры.Объект;
	КонецЕсли;
	
	// Мы не храним информацию о должности и подразделении пользователя,
	// так как эта информация может измениться и будет рахождение данных
	// в карточке пользователя и карточке заинтересованного лица.
	Если ЗначениеЗаполнено(Запись.Пользователь) И ТипЗнч(Запись.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		ЗаполнитьДолжность(Запись);
		Элементы.Должность.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Запись.ИсходныйКлючЗаписи.Пустой() Тогда
		ТекущийОбъект.ДатаДобавления = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Так как мы не храним информацию должности и подразделении
	//  пользователя, то нужно очистить эти поля
	Если ЗначениеЗаполнено(ТекущийОбъект.Пользователь)
		И ТипЗнч(ТекущийОбъект.Пользователь) = Тип("СправочникСсылка.Пользователи") Тогда
		
		ТекущийОбъект.Должность = Справочники.Должности.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбрабтчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДолжностьОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить("Пользователи", "Пользователи");
	СписокТипов.Добавить("Подписчики", "Подписчики");
	
	Если ТипЗнч(Запись.Пользователь) = Тип("Неопределено") Тогда
		АктивныйЭлемент = Неопределено;
	Иначе
		ТипОбъектаОснования = СтрЗаменить(ТРег(ТипЗнч(Запись.Пользователь)), " ", "");
		АктивныйЭлемент = СписокТипов.НайтиПоЗначению(ТипОбъектаОснования);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборТипаПользователя", ЭтотОбъект);
	СписокТипов.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выбор типа данных", АктивныйЭлемент);
		
КонецПроцедуры

&НаКлиенте
Процедура ПользовательОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ОбработатьЗапись(Команда)
	
	Записать();
	
	Если Команда.Имя = "ЗаписатьИЗакрыть" Тогда
		Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьДолжность(Запись)
	
	Запись.Должность = ПолучитьДолжность(Запись.Пользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборТипаПользователя(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьВыборПользователя", ЭтотОбъект);
	
	Если ВыбранныйЭлемент.Значение = "Пользователи" Тогда		
		ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", Новый Структура("ТолькоПросмотр", Истина), ЭтотОбъект,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
	Иначе			
		ПоказатьВводСтроки(ОписаниеОповещения,, "Адрес электронной почты", 50);
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОбработатьВыборПользователя(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	// В зависимости от типа выбранного пользователя выполним разные
	// действия.
	ТипПользователя = ТипЗнч(Результат);
	
	Если ТипПользователя = Тип("СправочникСсылка.Пользователи") Тогда
		Модифицированность = Истина;
		Запись.Пользователь = Результат;
	Иначе
		РезультатПроверки = ПроверитьПодписчикаНаСервере(Результат);
		Если ЗначениеЗаполнено(РезультатПроверки.ТекстОшибки) Тогда
			ПоказатьПредупреждение(, РезультатПроверки.ТекстОшибки);
		Иначе
			Модифицированность = Истина;
			Запись.Пользователь = РезультатПроверки.Подписчик;
		КонецЕсли;
	КонецЕсли;
	
	// Заблокируем некоторые элементы на форме.
	УстановитьДоступностьЭлементов(ТипПользователя);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДолжность(Знач Пользователь)
	
	Должность = Справочники.Должности.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛичныеДелаСрезПоследних.Данные КАК Должность
	|ИЗ
	|	РегистрСведений.ЛичныеДела.СрезПоследних(
	|			&ТекущаяДата,
	|			Сотрудник = &Сотрудник
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоЛичнымДелам.ПринятНаДолжность)) КАК ЛичныеДелаСрезПоследних";
	
	Запрос.УстановитьПараметр("Сотрудник", Пользователь);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Должность = Выборка.Должность;
	КонецЕсли;
	
	Возврат Должность;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьПодписчикаНаСервере(Почта)
	
	Возврат ОбщегоНазначения.ПроверитьПодписчикаНаСервере(Почта);
	
КонецФункции

&НаКлиенте
Процедура УстановитьДоступностьЭлементов(Знач ТипПользователя)
	
	Запись.Должность = Неопределено;
		
	Если ТипПользователя = Тип("СправочникСсылка.Пользователи") Тогда
		ЗаполнитьДолжность(Запись);
	КонецЕсли;
	
	Элементы.Должность.ТолькоПросмотр = (ТипПользователя = Тип("СправочникСсылка.Пользователи"));

КонецПроцедуры

#КонецОбласти
